Revit 2027 API
RailConnectionOption Enumeration
 The connections between rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailConnectionOption
Public Enumeration RailConnectionOption
public enum class RailConnectionOption
type RailConnectionOption
Members
Member name | Value | Description
Trim | 0 |  Rails will be trimmed and cut with a vertical plane.
Weld | 1 |  Rails will be joined in a manner as close to a miter as possible.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace